<a href="https://colab.research.google.com/github/RaianaSeixas/Pyspark/blob/main/Aula_1_Introdu%C3%A7%C3%A3o_ao_PySpark.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**Preparando o ambiente para utilizar o PySpark**

## **Instalando o Java**

O Apache Spark depende de outros sistemas, portanto, antes do Spark é preciso instalar as dependências. Primeiro, deve-se instalar o java

In [2]:
!apt-get install openjdk-8-jdk-headless -qq > /dev/null

## **Instalando o Apache Spark**

Em seguida, é preciso fazer o download do Spark, e, também, do hadoop, pois o Apache Spark roda sob o HDFS, em sua máquina (no caso aqui, na máquina virtual do Google Colab que você está usando.

In [3]:
# Fazendo download
!wget -q https://archive.apache.org/dist/spark/spark-3.1.2/spark-3.1.2-bin-hadoop2.7.tgz

# Descompactando os arquivos
!tar xf spark-3.1.2-bin-hadoop2.7.tgz

## **Configurando o ambiente**

Pronto! Agora precisamos dizer para o sistema onde encontrar o Java e o Spark, que instalamos a pouco neste ambiente.

In [4]:
# Importando a biblioteca os
import os

# Definindo a variável de ambiente do Java
os.environ["JAVA_HOME"] = "/usr/lib/jvm/java-8-openjdk-amd64"

# Definindo a variável de ambiente do Spark
os.environ["SPARK_HOME"] = "/content/spark-3.1.2-bin-hadoop2.7"

A seguir, vamos precisar da biblioteca findspark que vai nos permitir importar pacotes necessários para o funcionamento do pyspark

In [5]:
# instalando a findspark
!pip install -q findspark

In [6]:
#importando a findspark
import findspark

# iniciando o findspark
findspark.init()

## **Primeiros passos no Apache Spark com PySpark**

Vamos abrir um sessão Spark para poder trabalhar com esta FrameWork.

In [7]:
# importando o pacote necessário
from pyspark.sql import SparkSession

# iniciando o spark context
spark = SparkSession.builder.getOrCreate()

In [22]:
from pyspark.sql.functions import *

In [63]:
schema = ["employee_name","department","state","salary","age","bonus"]

simpleData = [("James","Sales","NY",90000,34,10000),
    ("Michael","Sales","NY",86000,56,20000),
    ("Mary","Sales","KS",96000,60,12000),
    ("Robert","Sales","CA",81000,30,23000),
    ("Maria","Finance","CA",90000,24,23000),
    ("Raman","Finance","CA",99000,40,24000),
    ("Scott","Finance","NY",83000,36,19000),
    ("Jen","Finance","NY",79000,53,15000),
    ("Jeff","Marketing","CA",80000,25,18000),
    ("Kumar","Marketing","NY",91000,50,21000),
    ("Ana","Marketing","KS",88000,40,15000),
    ("John","Marketing","KS",70000,21,21000),
    ("Scarlet","IT","NY",79000,26,19000),
    ("Kevin","IT","NY",83000,29,17000),
    ("Jason","IT","CA",90000,36,20000),
  ]

df = spark.createDataFrame(data=simpleData, schema = schema)
df.printSchema()

root
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- state: string (nullable = true)
 |-- salary: long (nullable = true)
 |-- age: long (nullable = true)
 |-- bonus: long (nullable = true)

In [47]:
df.show()

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|        James|     Sales|   NY| 90000| 34|10000|
|      Michael|     Sales|   NY| 86000| 56|20000|
|         Mary|     Sales|   KS| 96000| 60|12000|
|       Robert|     Sales|   CA| 81000| 30|23000|
|        Maria|   Finance|   CA| 90000| 24|23000|
|        Raman|   Finance|   CA| 99000| 40|24000|
|        Scott|   Finance|   NY| 83000| 36|19000|
|          Jen|   Finance|   NY| 79000| 53|15000|
|         Jeff| Marketing|   CA| 80000| 25|18000|
|        Kumar| Marketing|   NY| 91000| 50|21000|
|          Ana| Marketing|   KS| 88000| 40|15000|
|         John| Marketing|   KS| 70000| 21|21000|
|      Scarlet|        TI|   NY| 79000| 26|19000|
|        Kevin|        TI|   NY| 83000| 29|17000|
|        Jason|        TI|   CA| 90000| 36|20000|
+-------------+----------+-----+------+---+-----+

In [48]:
df.describe().show()

+-------+-------------+----------+-----+-----------------+------------------+------------------+
|summary|employee_name|department|state|           salary|               age|             bonus|
+-------+-------------+----------+-----+-----------------+------------------+------------------+
|  count|           15|        15|   15|               15|                15|                15|
|   mean|         null|      null| null|85666.66666666667|37.333333333333336|18466.666666666668|
| stddev|         null|      null| null|7451.430032135408|12.378937564997056|4050.8670441676813|
|    min|          Ana|   Finance|   CA|            70000|                21|             10000|
|    max|        Scott|        TI|   NY|            99000|                60|             24000|
+-------+-------------+----------+-----+-----------------+------------------+------------------+

In [49]:
df.groupBy("department").count().show()

+----------+-----+
|department|count|
+----------+-----+
|     Sales|    4|
|        TI|    3|
|   Finance|    4|
| Marketing|    4|
+----------+-----+

In [50]:
df.groupBy("department").avg("salary").show()

+----------+-----------+
|department|avg(salary)|
+----------+-----------+
|     Sales|    88250.0|
|        TI|    84000.0|
|   Finance|    87750.0|
| Marketing|    82250.0|
+----------+-----------+

In [51]:
df.groupBy("department","state") \
   .sum("salary","bonus") \
   .orderBy("department") \
   .show()

+----------+-----+-----------+----------+
|department|state|sum(salary)|sum(bonus)|
+----------+-----+-----------+----------+
|   Finance|   CA|     189000|     47000|
|   Finance|   NY|     162000|     34000|
| Marketing|   KS|     158000|     36000|
| Marketing|   CA|      80000|     18000|
| Marketing|   NY|      91000|     21000|
|     Sales|   CA|      81000|     23000|
|     Sales|   NY|     176000|     30000|
|     Sales|   KS|      96000|     12000|
|        TI|   NY|     162000|     36000|
|        TI|   CA|      90000|     20000|
+----------+-----+-----------+----------+

In [52]:
df.groupBy("department") \
    .agg(sum("salary").alias("sum_salary"), \
         avg("salary").alias("avg_salary"), \
         sum("bonus").alias("sum_bonus"), \
         max("bonus").alias("max_bonus") \
     ) \
    .show(truncate=False)

+----------+----------+----------+---------+---------+
|department|sum_salary|avg_salary|sum_bonus|max_bonus|
+----------+----------+----------+---------+---------+
|Sales     |353000    |88250.0   |65000    |23000    |
|TI        |252000    |84000.0   |56000    |20000    |
|Finance   |351000    |87750.0   |81000    |24000    |
|Marketing |329000    |82250.0   |75000    |21000    |
+----------+----------+----------+---------+---------+

In [53]:
df.groupBy("department") \
    .agg(sum("salary").alias("sum_salary"), \
      avg("salary").alias("avg_salary"), \
      sum("bonus").alias("sum_bonus"), \
      max("bonus").alias("max_bonus")) \
    .where(col("sum_bonus") >= 50000) \
    .show()

+----------+----------+----------+---------+---------+
|department|sum_salary|avg_salary|sum_bonus|max_bonus|
+----------+----------+----------+---------+---------+
|     Sales|    353000|   88250.0|    65000|    23000|
|        TI|    252000|   84000.0|    56000|    20000|
|   Finance|    351000|   87750.0|    81000|    24000|
| Marketing|    329000|   82250.0|    75000|    21000|
+----------+----------+----------+---------+---------+

In [57]:
df.groupBy("state") \
  .agg(avg("salary").alias("avg_salary"), \
    avg("age")) \
  .show()

+-----+-----------------+------------------+
|state|       avg_salary|          avg(age)|
+-----+-----------------+------------------+
|   CA|          88000.0|              31.0|
|   NY|84428.57142857143| 40.57142857142857|
|   KS|84666.66666666667|40.333333333333336|
+-----+-----------------+------------------+

In [82]:
df2=df.select("*") \
  .where(col("age") < 40)
  
df2.show()

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|        James|     Sales|   NY| 90000| 34|10000|
|       Robert|     Sales|   CA| 81000| 30|23000|
|        Maria|   Finance|   CA| 90000| 24|23000|
|        Scott|   Finance|   NY| 83000| 36|19000|
|         Jeff| Marketing|   CA| 80000| 25|18000|
|         John| Marketing|   KS| 70000| 21|21000|
|      Scarlet|        IT|   NY| 79000| 26|19000|
|        Kevin|        IT|   NY| 83000| 29|17000|
|        Jason|        IT|   CA| 90000| 36|20000|
+-------------+----------+-----+------+---+-----+

In [85]:
df2.agg(avg(col("salary"))).show()

+-----------------+
|      avg(salary)|
+-----------------+
|82888.88888888889|
+-----------------+

In [91]:
# Filtre as pessoas que ganham mais de 85 mil e calcule a média de idade dessas pessoas

df3 = df.select("*") \
  .where((col("salary") > 85000) & (col("bonus")>=15000))

df3.show()

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|      Michael|     Sales|   NY| 86000| 56|20000|
|        Maria|   Finance|   CA| 90000| 24|23000|
|        Raman|   Finance|   CA| 99000| 40|24000|
|        Kumar| Marketing|   NY| 91000| 50|21000|
|          Ana| Marketing|   KS| 88000| 40|15000|
|        Jason|        IT|   CA| 90000| 36|20000|
+-------------+----------+-----+------+---+-----+

In [92]:
# Soma salário mais bonus maior ou igual a 100

df.select('*').where((col("salary") + col("bonus") >= 100000)).show()

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|        James|     Sales|   NY| 90000| 34|10000|
|      Michael|     Sales|   NY| 86000| 56|20000|
|         Mary|     Sales|   KS| 96000| 60|12000|
|       Robert|     Sales|   CA| 81000| 30|23000|
|        Maria|   Finance|   CA| 90000| 24|23000|
|        Raman|   Finance|   CA| 99000| 40|24000|
|        Scott|   Finance|   NY| 83000| 36|19000|
|        Kumar| Marketing|   NY| 91000| 50|21000|
|          Ana| Marketing|   KS| 88000| 40|15000|
|        Kevin|        IT|   NY| 83000| 29|17000|
|        Jason|        IT|   CA| 90000| 36|20000|
+-------------+----------+-----+------+---+-----+

In [95]:
# Calcule a média de salários das pessoas que moram em NY ou CA

df.select('*').where((col('state') == 'CA') | (col('state') == 'NY')) \
  .agg(avg(col('salary'))) \
  .show()

+-----------------+
|      avg(salary)|
+-----------------+
|85916.66666666667|
+-----------------+